
import '../../App.css';

function About() {
  return (
    <div>
      <h1>Про мене</h1>
      <h2>Це сторінка де є інформація про мене.</h2>
      <p className="text">Народився 1 (13) листопада 1889 року[3] на хуторі біля містечка (тепер село) Грунь, нині Охтирський район Сумської області, в багатодітній (17 дітей) сім'ї відставного солдата Михайла Кіндратовича Губенка та його дружини Параскеви Олександрівни, до шлюбу Балаш[4]. Батько працював на поміщика, його дід по батьковій лінії був у Лебедині шевцем, дід по матері — у Груні хліборобом[5].
Закінчив початкову, потім двокласну школу в Зінькові, далі навчався в Київській військово-фельдшерській школі, по закінченню якої у 1907 році працював фельдшером — спочатку в російській армії, а згодом — у хірургічному відділі лікарні Південно-Західної залізниці[6]. Та, як згадував письменник, він не збирався присвятити себе медицині — тож, працюючи в лікарні, займався самоосвітою, склав екстерном екзамен за гімназію і в 1917 році вступив до Київського університету; однак невдовзі залишив навчання та цілком віддався журналістській і літературній праці. Вчився добре.</p>
    </div>
  );
}

export default About;
